posts/C++/multiple-dispatch.org
#+TITLE: Las soluciones buena, fea y mala del multiple dispatch en C++
#+date:<2023-07-29 sá.>

Una de las herramientas más importantes de la orientación a objetos es el polimorfismo, y es que la capacidad de elegir la función correcta a partir de un objeto del que sólo conocemos su clase abstracta ofrece bastante poder al programador. Así, en lugar de llamar a una función diferente para acelerar un coche, una furgoneta o un camión podemos llamar a la función acelerar de la clase abstracta vehículo. En lugar de llamar a una función distinta para obtener el área de un círculo, un triángulo o un rectaágulo podemos usar la función area de la clase abstracta figura.

C++ usa los métodos virtules para conseguir el polimorfismo y en el momento en el que se efectúa la elección de la función se dice que se ha realizado un *single dispatch*.

#+begin_src C++ :exports both :eval never-export :results output
  #include <iostream>

  struct Figura{
	  virtual float area() = 0;
  };

  struct Circulo : public Figura{
	  float radio;
	
	  Circulo(float _radio)
		  : radio(_radio) {}

	  float area(){
		  return 3.14f*radio*radio;
	  }
  };

  struct Rectangulo : public Figura{
	  float height;
	  float width;

	  Rectangulo(float _height, float _width)
		  : height(_height), width(_width) {}

	  float area(){
		  return height*width;
	  }
  };

  int main(){
	  Figura* f1 = new Circulo(5.f);
	  Figura* f2 = new Rectangulo(3.f,4.f);

	  std::cout << "La figura 1 tiene área: " << f1->area() << std::endl;
	  std::cout << "La figura 2 tiene área: " << f2->area() << std::endl;
  }
#+end_src

#+RESULTS:
: La figura 1 tiene área: 78.5
: La figura 2 tiene área: 12

Se llama *single dispatch* porque sólo interviene un objeto en la elección de la función correcta. Si son varios objetos los que deben determinar a qué función llamar, entonces hablamos de *multiple dispatch*. Desgraciadamente no hay en C++ una forma ‘oficial’ de resolver el problema del *multiple dispatch*, por lo que existen varias soluciones, cada una con sus ventajas e inconvenientes. 

Como ejemplo, imagina el problema de comprobar si dos figuras intersectan. Dependiendo de las figuras de las que hablemos, el algoritmo de intersección es diferente.

#+begin_src cpp
  struct Figura{
	  virtual bool intersect(Figura* other) = 0;
  };

  struct Circulo : public Figura{
	  float x, y;
	  float radio;

	  virtual bool intersect(Figura* other) override{
		  // ????????
	  }
  };

  struct Rectangulo : public Figura{
	  float x, y;
	  float height;
	  float width;

	  virtual bool intersect(Figura* other) override{
		  // ????????
	  }
  };

#+end_src

En las siguientes secciones veremos las posibles soluciones disponibles, pasando por varios *single dispatch*, el uso de *dynamic​_​cast* y los *open multi-methods*.

