docs/posts/C++/multiple-dispatch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 29-07-2023 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Las soluciones buena, fea y mala del multiple dispatch en C++</title>
<meta name="author" content="Héctor Galbis Sanchis" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/lispylambda/css/gongzhitaao.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://hectarea1996.github.io/lispylambda/"> UP </a>
 |
 <a accesskey="H" href="https://hectarea1996.github.io/lispylambda/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Las soluciones buena, fea y mala del multiple dispatch en C++</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6174eec">La solución mala: Dos single dispatches</a></li>
<li><a href="#org27673d2">La solución fea: dynamic​_​cast</a></li>
<li><a href="#org79eb64d">La solución buena: Open multi-methods</a></li>
<li><a href="#org7af106c">Conclusión</a></li>
</ul>
</div>
</div>
<p>
Una de las herramientas más importantes de la orientación a objetos es el polimorfismo, y es que la capacidad de elegir la función correcta a partir de un objeto del que sólo conocemos su clase abstracta ofrece bastante poder al programador. Así, en lugar de llamar a una función diferente para acelerar un coche, una furgoneta o un camión podemos llamar a la función acelerar de la clase abstracta vehículo. En lugar de llamar a una función distinta para obtener el área de un círculo, un triángulo o un rectaágulo podemos usar la función area de la clase abstracta figura.
</p>

<p>
C++ usa los métodos virtules para conseguir el polimorfismo y en el momento en el que se efectúa la elección de la función se dice que se ha realizado un <b>single dispatch</b>.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #c586c0;">#include</span> <span style="color: #ce9178;">&lt;iostream&gt;</span>

<span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Figura</span>{
    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">float</span> <span style="color: #dcdcaa;">area</span>() = 0;
};

<span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Circulo</span> : <span style="color: #569cd6;">public</span> <span style="color: #4ec9b0;">Figura</span>{
    <span style="color: #4ec9b0;">float</span> <span style="color: #9cdcfe;">radio</span>;

    <span style="color: #dcdcaa;">Circulo</span>(<span style="color: #4ec9b0;">float</span> <span style="color: #9cdcfe;">_radio</span>)
        : radio(_radio) {}

    <span style="color: #4ec9b0;">float</span> <span style="color: #dcdcaa;">area</span>(){
        <span style="color: #569cd6;">return</span> 3.14f*radio*radio;
    }
};

<span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Rectangulo</span> : <span style="color: #569cd6;">public</span> <span style="color: #4ec9b0;">Figura</span>{
    <span style="color: #4ec9b0;">float</span> <span style="color: #9cdcfe;">height</span>;
    <span style="color: #4ec9b0;">float</span> <span style="color: #9cdcfe;">width</span>;

    <span style="color: #dcdcaa;">Rectangulo</span>(<span style="color: #4ec9b0;">float</span> <span style="color: #9cdcfe;">_height</span>, <span style="color: #4ec9b0;">float</span> <span style="color: #9cdcfe;">_width</span>)
        : height(_height), width(_width) {}

    <span style="color: #4ec9b0;">float</span> <span style="color: #dcdcaa;">area</span>(){
        <span style="color: #569cd6;">return</span> height*width;
    }
};

<span style="color: #4ec9b0;">int</span> <span style="color: #dcdcaa;">main</span>(){
    <span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f1</span> = <span style="color: #569cd6;">new</span> <span style="color: #4ec9b0;">Circulo</span>(5.f);
    <span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f2</span> = <span style="color: #569cd6;">new</span> <span style="color: #4ec9b0;">Rectangulo</span>(3.f,4.f);

    <span style="color: #569cd6;">std</span>::cout &lt;&lt; <span style="color: #ce9178;">"La figura 1 tiene &#225;rea: "</span> &lt;&lt; f1-&gt;area() &lt;&lt; <span style="color: #569cd6;">std</span>::endl;
    <span style="color: #569cd6;">std</span>::cout &lt;&lt; <span style="color: #ce9178;">"La figura 2 tiene &#225;rea: "</span> &lt;&lt; f2-&gt;area() &lt;&lt; <span style="color: #569cd6;">std</span>::endl;
}
</pre>
</div>

<pre class="example">
La figura 1 tiene área: 78.5
La figura 2 tiene área: 12
</pre>


<p>
Se llama <b>single dispatch</b> porque sólo interviene un objeto en la elección de la función correcta. Si son varios objetos los que deben determinar a qué función llamar, entonces hablamos de <b>multiple dispatch</b>. Desgraciadamente no hay en C++ una forma ‘oficial’ de resolver el problema del <b>multiple dispatch</b>, por lo que existen varias soluciones, cada una con sus ventajas e inconvenientes. 
</p>

<p>
Como ejemplo, imagina el problema de comprobar si dos figuras intersectan. Dependiendo de las figuras de las que hablemos, el algoritmo de intersección es diferente.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Figura</span>{
    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">other</span>) = 0;
};

<span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Circulo</span> : <span style="color: #569cd6;">public</span> <span style="color: #4ec9b0;">Figura</span>{
    <span style="color: #4ec9b0;">float</span> <span style="color: #9cdcfe;">x</span>, <span style="color: #9cdcfe;">y</span>;
    <span style="color: #4ec9b0;">float</span> <span style="color: #9cdcfe;">radio</span>;

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">other</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">????????</span>
    }
};

<span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Rectangulo</span> : <span style="color: #569cd6;">public</span> <span style="color: #4ec9b0;">Figura</span>{
    <span style="color: #4ec9b0;">float</span> <span style="color: #9cdcfe;">x</span>, <span style="color: #9cdcfe;">y</span>;
    <span style="color: #4ec9b0;">float</span> <span style="color: #9cdcfe;">height</span>;
    <span style="color: #4ec9b0;">float</span> <span style="color: #9cdcfe;">width</span>;

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">other</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">????????</span>
    }
};

</pre>
</div>

<p>
En las siguientes secciones veremos las posibles soluciones disponibles, pasando por varios <b>single dispatch</b>, el uso de <b>dynamic​_​cast</b> y los <b>open multi-methods</b>.
</p>
