posts/C++/multiple-dispatch.org
* La solución mala: Dos single dispatches

Antes de aventurarse en el multiple dispatch debemos intentar primero solucionar el caso más sencillo, el *double dispatch*. Usaremos el ejemplo de las figuras y el método intersección durante las siguientes secciones. Lo que buscamos es una manera de elegir una de las siguientes funciones que implementan un algoritmo de intersección para dos objetos de un tipo concreto.

#+begin_src cpp
  bool intersect_impl(Circulo* c, Rectangulo* r){
	  // Algoritmo de intersección entre un círculo y un rectángulo
	  // ...
  }

  bool intersect_impl(Rectangulo* c, Circulo* r){
	  // Algoritmo de intersección entre un rectangulo y un circulo
	  // ...
  }

  bool intersect_impl(Circulo* t, Circulo* c){
	  // Algoritmo de intersección entre dos circulos
	  // ...
  }

  bool intersect_impl(Rectangulo* t, Rectangulo* c){
	  // Algoritmo de intersección entre dos rectangulos
	  // ...
  }
#+end_src

Sabemos que mediante el polimorfismo y los métodos virtuales podemos realizar un *single dispatch*. Así, el trabajo se reduce a la mitad. El método ~intersect~ en la clase abstracta ~Figura~ debería presentar la siguiente forma:

#+begin_src cpp
  struct Figura{

	  // ...

	  virtual bool intersect(Figura* f2) = 0;

  };
#+end_src

Y cada clase hija de ~Figura~ debería implementar su propio método intersect:

#+begin_src cpp
  struct Circulo : public Figura{

	  // ...
  
	  virtual bool intersect(Figura* f2) override{
		  // ???
	  }
  };

  struct Rectangulo : public Figura{

	  // ...

	  virtual bool intersect(Figura* f2) override{
		  // ???
	  }
  };
#+end_src

En el momento en el que ejecutemos ~f1->intersect(f2)~ con dos objetos ~Figura~ ~f1~ y ~f2~ entraremos en alguna especialización del método ~intersect~ dependiendo de la clase concreta de ~f1~. Es decir, si ~f1~ es en realidad un ~Circulo~, estaremos en el método ~intersect~ de la clase ~Circulo~. Lo que buscamos ahora es un *segundo single dispatch*. Sabiendo esto lo esperable es que los métodos intersect sean de la siguiente forma:

#+begin_src cpp
  struct Circulo : public Figura{

	  // ...

	  virtual bool intersect(Figura* f2) override{
		  return f2->intersect(this);
	  }
  };

  struct Rectangulo : public Figura{

	  // ...

	  virtual bool intersect(Figura* f2) override{
		  return f2->intersect(this);
	  }
  };
#+end_src

Observa ahora que cada ~this~ es del tipo puntero a la clase donde se encuentre. Es decir, si ~f1~ y ~f2~ son dos objetos ~Figura~ y ejecutamos ~f1→intersect(f2)~, si suponemos que ~f1~ es concretamente un ~Circulo~, entraremos en el método ~intersect~ de la clase ~Circulo~ que ejecutará ~f2→intersect(this)~ donde ~this~ es de tipo puntero a ~Circulo~. Sin embargo, no tenemos ningún método que acepte como argumento un ~Circulo~, sino una ~Figura~. Realizaríamos el single dispatch de ~f2~, pero perderíamos el anterior single dispatch al convertirse de nuevo en una ~Figura~. Además, fíjate que entraríamos en un bucle infinito, pues cada llamada a ~intersect~, llamaría de nuevo a ~intersect~, que llamaría de nuevo a ~intersect~ … Para solucionar este problema basta con sobrecargar el método ~intersect~ para poder recibir cada una de las clases concretas ~Circulo~ y ~Rectangulo~. Y así, finalmente, llamar a las funciones que contienen las implementaciones de cada intersección:

#+begin_src cpp
  struct Figura{

	  // ...

	  virtual bool intersect(Figura* f2) = 0;
	  virtual bool intersect(Circulo* c) = 0;
	  virtual bool intersect(Rectangulo* r) = 0;
  };

  struct Circulo : public Figura{
	  // ...

	  virtual bool intersect(Figura* f2) override{
		  return f2->intersect(this);
	  }
	  virtual bool intersect(Circulo* c) override{
		  return intersect_impl(this, c);
	  }
	  virtual bool intersect(Rectangulo* r) override{
		  return intersect_impl(this, r);
	  }
  };

  struct Rectangulo : public Figura{
	  // ...

	  virtual bool intersect(Figura* f2) override{
		  return f2->intersect(this);
	  }
	  virtual bool intersect(Circulo* c) override{
		  return intersect_impl(this, c);
	  }
	  virtual bool intersect(Rectangulo* r) override{
		  return intersect_impl(this, r);
	  }
  };

#+end_src

Y ya está, *double dispatch* solucionado.

Aunque hayamos conseguido solucionar el problema, fíjate que ahora cada clase tiene tres versiones distintas del método ~intersect~. Si quisiéramos añadir más clases, deberíamos modificar el resto de clases para poder seguir teniendo solucionado el *double dispatch*. Estamos ante una solución *muy intrusiva*. Además, supón ahora que queremos solucionar un *triple dispatch*. La solución pasa por realizar *otro single dispatch* con el tercer argumento, lo que hará que vuelva a aumentar el número de métodos por cada clase.

Claramente esta solución es inviable cuando nos enfrentamos a un problema real. A parte de la cantidad  abrumadora de métodos que tendría cada clase, la mantenibilidad del código se hace imposible. Un pequeño cambio podría suponer cambiar cientos o miles de líneas de código.

