docs/posts/C++/multiple-dispatch.html

<div id="outline-container-org6174eec" class="outline-2">
<h2 id="org6174eec">La solución mala: Dos single dispatches</h2>
<div class="outline-text-2" id="text-org6174eec">
<p>
Antes de aventurarse en el multiple dispatch debemos intentar primero solucionar el caso más sencillo, el <b>double dispatch</b>. Usaremos el ejemplo de las figuras y el método intersección durante las siguientes secciones. Lo que buscamos es una manera de elegir una de las siguientes funciones que implementan un algoritmo de intersección para dos objetos de un tipo concreto.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect_impl</span>(<span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">c</span>, <span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">r</span>){
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Algoritmo de intersecci&#243;n entre un c&#237;rculo y un rect&#225;ngulo</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>
}

<span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect_impl</span>(<span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">c</span>, <span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">r</span>){
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Algoritmo de intersecci&#243;n entre un rectangulo y un circulo</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>
}

<span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect_impl</span>(<span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">t</span>, <span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">c</span>){
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Algoritmo de intersecci&#243;n entre dos circulos</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>
}

<span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect_impl</span>(<span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">t</span>, <span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">c</span>){
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Algoritmo de intersecci&#243;n entre dos rectangulos</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>
}
</pre>
</div>

<p>
Sabemos que mediante el polimorfismo y los métodos virtuales podemos realizar un <b>single dispatch</b>. Así, el trabajo se reduce a la mitad. El método <code>intersect</code> en la clase abstracta <code>Figura</code> debería presentar la siguiente forma:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Figura</span>{

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f2</span>) = 0;

};
</pre>
</div>

<p>
Y cada clase hija de <code>Figura</code> debería implementar su propio método intersect:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Circulo</span> : <span style="color: #569cd6;">public</span> <span style="color: #4ec9b0;">Figura</span>{

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f2</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">???</span>
    }
};

<span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Rectangulo</span> : <span style="color: #569cd6;">public</span> <span style="color: #4ec9b0;">Figura</span>{

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f2</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">???</span>
    }
};
</pre>
</div>

<p>
En el momento en el que ejecutemos <code>f1-&gt;intersect(f2)</code> con dos objetos <code>Figura</code> <code>f1</code> y <code>f2</code> entraremos en alguna especialización del método <code>intersect</code> dependiendo de la clase concreta de <code>f1</code>. Es decir, si <code>f1</code> es en realidad un <code>Circulo</code>, estaremos en el método <code>intersect</code> de la clase <code>Circulo</code>. Lo que buscamos ahora es un <b>segundo single dispatch</b>. Sabiendo esto lo esperable es que los métodos intersect sean de la siguiente forma:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Circulo</span> : <span style="color: #569cd6;">public</span> <span style="color: #4ec9b0;">Figura</span>{

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f2</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #569cd6;">return</span> f2-&gt;intersect(<span style="color: #569cd6;">this</span>);
    }
};

<span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Rectangulo</span> : <span style="color: #569cd6;">public</span> <span style="color: #4ec9b0;">Figura</span>{

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f2</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #569cd6;">return</span> f2-&gt;intersect(<span style="color: #569cd6;">this</span>);
    }
};
</pre>
</div>

<p>
Observa ahora que cada <code>this</code> es del tipo puntero a la clase donde se encuentre. Es decir, si <code>f1</code> y <code>f2</code> son dos objetos <code>Figura</code> y ejecutamos <code>f1→intersect(f2)</code>, si suponemos que <code>f1</code> es concretamente un <code>Circulo</code>, entraremos en el método <code>intersect</code> de la clase <code>Circulo</code> que ejecutará <code>f2→intersect(this)</code> donde <code>this</code> es de tipo puntero a <code>Circulo</code>. Sin embargo, no tenemos ningún método que acepte como argumento un <code>Circulo</code>, sino una <code>Figura</code>. Realizaríamos el single dispatch de <code>f2</code>, pero perderíamos el anterior single dispatch al convertirse de nuevo en una <code>Figura</code>. Además, fíjate que entraríamos en un bucle infinito, pues cada llamada a <code>intersect</code>, llamaría de nuevo a <code>intersect</code>, que llamaría de nuevo a <code>intersect</code> … Para solucionar este problema basta con sobrecargar el método <code>intersect</code> para poder recibir cada una de las clases concretas <code>Circulo</code> y <code>Rectangulo</code>. Y así, finalmente, llamar a las funciones que contienen las implementaciones de cada intersección:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Figura</span>{

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f2</span>) = 0;
    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">c</span>) = 0;
    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">r</span>) = 0;
};

<span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Circulo</span> : <span style="color: #569cd6;">public</span> <span style="color: #4ec9b0;">Figura</span>{
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f2</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #569cd6;">return</span> f2-&gt;intersect(<span style="color: #569cd6;">this</span>);
    }
    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">c</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #569cd6;">return</span> intersect_impl(<span style="color: #569cd6;">this</span>, c);
    }
    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">r</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #569cd6;">return</span> intersect_impl(<span style="color: #569cd6;">this</span>, r);
    }
};

<span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Rectangulo</span> : <span style="color: #569cd6;">public</span> <span style="color: #4ec9b0;">Figura</span>{
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f2</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #569cd6;">return</span> f2-&gt;intersect(<span style="color: #569cd6;">this</span>);
    }
    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">c</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #569cd6;">return</span> intersect_impl(<span style="color: #569cd6;">this</span>, c);
    }
    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">r</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #569cd6;">return</span> intersect_impl(<span style="color: #569cd6;">this</span>, r);
    }
};

</pre>
</div>

<p>
Y ya está, <b>double dispatch</b> solucionado.
</p>

<p>
Aunque hayamos conseguido solucionar el problema, fíjate que ahora cada clase tiene tres versiones distintas del método <code>intersect</code>. Si quisiéramos añadir más clases, deberíamos modificar el resto de clases para poder seguir teniendo solucionado el <b>double dispatch</b>. Estamos ante una solución <b>muy intrusiva</b>. Además, supón ahora que queremos solucionar un <b>triple dispatch</b>. La solución pasa por realizar <b>otro single dispatch</b> con el tercer argumento, lo que hará que vuelva a aumentar el número de métodos por cada clase.
</p>

<p>
Claramente esta solución es inviable cuando nos enfrentamos a un problema real. A parte de la cantidad  abrumadora de métodos que tendría cada clase, la mantenibilidad del código se hace imposible. Un pequeño cambio podría suponer cambiar cientos o miles de líneas de código.
</p>
</div>
</div>
