posts/C++/multiple-dispatch.org
* La solución fea: dynamic​_​cast

Desde el inicio de este post hemos hablado de realizar un correcto dispatch de cada uno de los objetos implicados en una función determinada. Observa que cuando se realiza un dispatch se está cambiando el tipo de un objeto, se está realizando un *casteo*. Esa es la principal idea de esta solución, buscar un casting adecuado para cada objeto. Como no podemos saber el tipo de dato al que debemos realizar el casting necesitaremos usar la fuerza bruta con *dynamic​_​cast*.

Al igual que en la solución anterior aprovecharemos las funciones virtuales para realizar un primer single dispatch. La clase ~Figura~ tendrá el siguiente aspecto:

#+begin_src C++
  struct Figura{

	  // ...

	  virtual bool intersect(Figura* f2) = 0;
  };
#+end_src

Cada una de las clases derivadas deberá implementar el método ~intersect~, y en este caso utilizarán *dynamic​_​cast* para obtener el tipo de la ~Figura~ ~f2~.

#+begin_src C++
  struct Circulo : public Figura{
	  // ...

	  virtual bool intersect(Figura* f2) override{
		  if (Circulo* c2 = dynamic_cast<Circulo*>(f2)){
			  return intersect_impl(this, c2);
		  }
		  else if (Rectangulo* r2 = dynamic_cast<Rectangulo*>(f2)){
			  return intersect_impl(this, r2);
		  }
		  return false;
	  }
  };

  struct Rectangulo : public Figura{
	  // ...

	  virtual bool intersect(Figura* f2) override{
		  if (Circulo* c2 = dynamic_cast<Circulo*>(f2)){
			  return intersect_impl(this, c2);
		  }
		  else if (Rectangulo* r2 = dynamic_cast<Rectangulo*>(f2)){
			  return intersect_impl(this, r2);
		  }
		  return false;
	  }
  };
#+end_src

Y de nuevo ya está, *double dispatch* solucionado. 

Fíjate que el número de métodos que implementa cada clase se ha reducido a uno sólo, mientras que antes necesitábamos ~n~ métodos si eran ~n~ clases (incluida la clase base) las que participaban en el double dispatch. Desgraciadamente el número de operaciones a realizar es ~n~ en el peor de los casos  (un single dispatch y n-1 dynamic​_​cast). Y por si fuera poco, la intrusividad no ha desaparecido del todo, pues si quisiésemos añadir una nueva clase derivada debemos modificar cada una de las clases anteriores (excepto la clase base ~Figura~) para seguir teniendo solucionado el double dispatch.

Para el caso de un *triple dispatch* deberíamos insertar dentro de cada una de las sentencias ~if~ una nueva capa de fuerza bruta con el tercer argumento. Ya te puedes imaginar cómo se agrandaría el método ~intersect~ en cada clase y más si usáramos un caso real con muchas más clases.

