docs/posts/C++/multiple-dispatch.html

<div id="outline-container-org27673d2" class="outline-2">
<h2 id="org27673d2">La solución fea: dynamic​_​cast</h2>
<div class="outline-text-2" id="text-org27673d2">
<p>
Desde el inicio de este post hemos hablado de realizar un correcto dispatch de cada uno de los objetos implicados en una función determinada. Observa que cuando se realiza un dispatch se está cambiando el tipo de un objeto, se está realizando un <b>casteo</b>. Esa es la principal idea de esta solución, buscar un casting adecuado para cada objeto. Como no podemos saber el tipo de dato al que debemos realizar el casting necesitaremos usar la fuerza bruta con <b>dynamic​_​cast</b>.
</p>

<p>
Al igual que en la solución anterior aprovecharemos las funciones virtuales para realizar un primer single dispatch. La clase <code>Figura</code> tendrá el siguiente aspecto:
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Figura</span>{

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f2</span>) = 0;
};
</pre>
</div>

<p>
Cada una de las clases derivadas deberá implementar el método <code>intersect</code>, y en este caso utilizarán <b>dynamic​_​cast</b> para obtener el tipo de la <code>Figura</code> <code>f2</code>.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Circulo</span> : <span style="color: #569cd6;">public</span> <span style="color: #4ec9b0;">Figura</span>{
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f2</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #569cd6;">if</span> (<span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">c2</span> = <span style="color: #569cd6;">dynamic_cast</span>&lt;<span style="color: #4ec9b0;">Circulo</span>*&gt;(f2)){
            <span style="color: #569cd6;">return</span> intersect_impl(<span style="color: #569cd6;">this</span>, c2);
        }
        <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> (<span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">r2</span> = <span style="color: #569cd6;">dynamic_cast</span>&lt;<span style="color: #4ec9b0;">Rectangulo</span>*&gt;(f2)){
            <span style="color: #569cd6;">return</span> intersect_impl(<span style="color: #569cd6;">this</span>, r2);
        }
        <span style="color: #569cd6;">return</span> <span style="color: #569cd6;">false</span>;
    }
};

<span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">Rectangulo</span> : <span style="color: #569cd6;">public</span> <span style="color: #4ec9b0;">Figura</span>{
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>

    <span style="color: #569cd6;">virtual</span> <span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect</span>(<span style="color: #4ec9b0;">Figura</span>* <span style="color: #9cdcfe;">f2</span>) <span style="color: #569cd6;">override</span>{
        <span style="color: #569cd6;">if</span> (<span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">c2</span> = <span style="color: #569cd6;">dynamic_cast</span>&lt;<span style="color: #4ec9b0;">Circulo</span>*&gt;(f2)){
            <span style="color: #569cd6;">return</span> intersect_impl(<span style="color: #569cd6;">this</span>, c2);
        }
        <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> (<span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">r2</span> = <span style="color: #569cd6;">dynamic_cast</span>&lt;<span style="color: #4ec9b0;">Rectangulo</span>*&gt;(f2)){
            <span style="color: #569cd6;">return</span> intersect_impl(<span style="color: #569cd6;">this</span>, r2);
        }
        <span style="color: #569cd6;">return</span> <span style="color: #569cd6;">false</span>;
    }
};
</pre>
</div>

<p>
Y de nuevo ya está, <b>double dispatch</b> solucionado. 
</p>

<p>
Fíjate que el número de métodos que implementa cada clase se ha reducido a uno sólo, mientras que antes necesitábamos <code>n</code> métodos si eran <code>n</code> clases (incluida la clase base) las que participaban en el double dispatch. Desgraciadamente el número de operaciones a realizar es <code>n</code> en el peor de los casos  (un single dispatch y n-1 dynamic​_​cast). Y por si fuera poco, la intrusividad no ha desaparecido del todo, pues si quisiésemos añadir una nueva clase derivada debemos modificar cada una de las clases anteriores (excepto la clase base <code>Figura</code>) para seguir teniendo solucionado el double dispatch.
</p>

<p>
Para el caso de un <b>triple dispatch</b> deberíamos insertar dentro de cada una de las sentencias <code>if</code> una nueva capa de fuerza bruta con el tercer argumento. Ya te puedes imaginar cómo se agrandaría el método <code>intersect</code> en cada clase y más si usáramos un caso real con muchas más clases.
</p>
</div>
</div>
