posts/C++/multiple-dispatch.org
* La solución buena: Open multi-methods

Una de las características más importantes de C++ es la sobrecarga de funciones. Podemos conseguir diferentes implementaciones de la misma función si los parámetros que le proporcionamos a la función son diferentes. Esto ya lo hemos visto con las funciones ~intersect_impl~.

#+begin_src C++
  bool intersect_impl(Circulo* c, Rectangulo* r){
	  // Algoritmo de intersección entre un círculo y un rectángulo
	  // ...
  }

  bool intersect_impl(Rectangulo* c, Circulo* r){
	  // Algoritmo de intersección entre un rectangulo y un circulo
	  // ...
  }

  bool intersect_impl(Circulo* t, Circulo* c){
	  // Algoritmo de intersección entre dos circulos
	  // ...
  }

  bool intersect_impl(Rectangulo* t, Rectangulo* c){
	  // Algoritmo de intersección entre dos rectangulos
	  // ...
  }
#+end_src

Imagina que añadimos la siguiente funcionalidad a C++: *Parámetros virtuales*. Los parámetros virtuales son capaces de realizar un *single dispatch* al momento de ejecutar la función.

Un hipotético ejemplo con la función ~intersect_impl~ sería el siguiente:

#+begin_src C++
  // Declaracion de la funcion con argumentos virtuales
  bool intersect_impl(virtual Figura* f1, virtual Figura* f2);

  // Implementaciones dependiendo del tipo pasado como parametro
  bool intersect_impl(Circulo* c, Rectangulo* r){
	  // Algoritmo de intersección entre un círculo y un rectángulo
	  // ...
  }

  bool intersect_impl(Rectangulo* c, Circulo* r){
	  // Algoritmo de intersección entre un rectangulo y un circulo
	  // ...
  }

  bool intersect_impl(Circulo* t, Circulo* c){
	  // Algoritmo de intersección entre dos circulos
	  // ...
  }

  bool intersect_impl(Rectangulo* t, Rectangulo* c){
	  // Algoritmo de intersección entre dos rectangulos
	  // ...
  }
#+end_src

Es decir, por un lado indicamos cómo es la función y qué parámetros son virtuales. Por otro, cada una de las implementaciones.

Estos son los denominados *open multi-methods*, llamados así por *no* estar dentro de ninguna clase (open), y por admitir multiples implementaciones (multi). Este tipo de funciones están disponibles en otros lenguajes como C# o Common Lisp, y por desgracia C++ no los ha implementado aún.

Al no existir los open multi-methods en C++, la única opción es que las creamos nosotros mismos. El problema es que esto requiere bastante trabajo y no merece la pena hablar de los detalles aquí. Pero sí podemos comentar algunos de los requisitos:

- Una tabla de punteros a funciones.
- Una forma de obtener el tipo concreto de un objeto en tiempo de ejecución.

Y la idea de su funcionamiento es muy sencilla: Primero obtienes el tipo concreto de cada uno de los argumentos virtuales. Y, a partir de esta información, debemos ser capaces de obtener un índice que nos diga qué función de nuestra tabla debemos llamar.

Si tienes curiosidad sobre los detalles de la implementación de los open multi-methods, te dejo el blog de Jean Louis Leroy: [[https://www.codeproject.com/Articles/635264/Open-Multi-Methods-for-Cplusplus11-Part-1-The-Case][Open Multi-Methods for C++11]].

A día de hoy, sólo conozco una librería que podría usarse en un proyecto serio: [[https://github.com/jll63/yomm2][Yomm2]], de Jean Louis Leroy (el autor del blog anterior).

Yo, por otro lado, intenté en su día crear también una implementación de los open multi-methods, y la verdad es que estoy bastante orgulloso de ello. Se llama [[https://github.com/Hectarea1996/omm][omm]] y es un simple fichero ~omm.h~ de 1000 líneas de código.

* Conclusión

Creo que es claro que la mejor solución para resolver el problema del *double* o *multiple dispatch* es el uso de *open multi-methods*. Son limpios, claros, fáciles de usar, etc. Es por ello que me extraña que un lenguaje como C++ no los tenga aún implementados. Y no es que este tipo de métodos sean nuevos, existen desde hace ya años. Por ejemplo, Common Lisp los tiene y es un lenguaje que no se actualiza desde el año 1999. Ains, cómo te echo de menos Common Lisp...

:D
