docs/posts/C++/multiple-dispatch.html

<div id="outline-container-org79eb64d" class="outline-2">
<h2 id="org79eb64d">La solución buena: Open multi-methods</h2>
<div class="outline-text-2" id="text-org79eb64d">
<p>
Una de las características más importantes de C++ es la sobrecarga de funciones. Podemos conseguir diferentes implementaciones de la misma función si los parámetros que le proporcionamos a la función son diferentes. Esto ya lo hemos visto con las funciones <code>intersect_impl</code>.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect_impl</span>(<span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">c</span>, <span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">r</span>){
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Algoritmo de intersecci&#243;n entre un c&#237;rculo y un rect&#225;ngulo</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>
}

<span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect_impl</span>(<span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">c</span>, <span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">r</span>){
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Algoritmo de intersecci&#243;n entre un rectangulo y un circulo</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>
}

<span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect_impl</span>(<span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">t</span>, <span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">c</span>){
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Algoritmo de intersecci&#243;n entre dos circulos</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>
}

<span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect_impl</span>(<span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">t</span>, <span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">c</span>){
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Algoritmo de intersecci&#243;n entre dos rectangulos</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>
}
</pre>
</div>

<p>
Imagina que añadimos la siguiente funcionalidad a C++: <b>Parámetros virtuales</b>. Los parámetros virtuales son capaces de realizar un <b>single dispatch</b> al momento de ejecutar la función.
</p>

<p>
Un hipotético ejemplo con la función <code>intersect_impl</code> sería el siguiente:
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #6a9955;">// </span><span style="color: #6a9955;">Declaracion de la funcion con argumentos virtuales</span>
<span style="color: #4ec9b0;">bool</span> <span style="color: #9cdcfe;">intersect_impl</span>(<span style="color: #569cd6;">virtual</span> Figura* f1, <span style="color: #569cd6;">virtual</span> Figura* f2);

<span style="color: #6a9955;">// </span><span style="color: #6a9955;">Implementaciones dependiendo del tipo pasado como parametro</span>
<span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect_impl</span>(<span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">c</span>, <span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">r</span>){
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Algoritmo de intersecci&#243;n entre un c&#237;rculo y un rect&#225;ngulo</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>
}

<span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect_impl</span>(<span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">c</span>, <span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">r</span>){
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Algoritmo de intersecci&#243;n entre un rectangulo y un circulo</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>
}

<span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect_impl</span>(<span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">t</span>, <span style="color: #4ec9b0;">Circulo</span>* <span style="color: #9cdcfe;">c</span>){
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Algoritmo de intersecci&#243;n entre dos circulos</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>
}

<span style="color: #4ec9b0;">bool</span> <span style="color: #dcdcaa;">intersect_impl</span>(<span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">t</span>, <span style="color: #4ec9b0;">Rectangulo</span>* <span style="color: #9cdcfe;">c</span>){
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Algoritmo de intersecci&#243;n entre dos rectangulos</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">...</span>
}
</pre>
</div>

<p>
Es decir, por un lado indicamos cómo es la función y qué parámetros son virtuales. Por otro, cada una de las implementaciones.
</p>

<p>
Estos son los denominados <b>open multi-methods</b>, llamados así por <b>no</b> estar dentro de ninguna clase (open), y por admitir multiples implementaciones (multi). Este tipo de funciones están disponibles en otros lenguajes como C# o Common Lisp, y por desgracia C++ no los ha implementado aún.
</p>

<p>
Al no existir los open multi-methods en C++, la única opción es que las creamos nosotros mismos. El problema es que esto requiere bastante trabajo y no merece la pena hablar de los detalles aquí. Pero sí podemos comentar algunos de los requisitos:
</p>

<ul class="org-ul">
<li>Una tabla de punteros a funciones.</li>
<li>Una forma de obtener el tipo concreto de un objeto en tiempo de ejecución.</li>
</ul>

<p>
Y la idea de su funcionamiento es muy sencilla: Primero obtienes el tipo concreto de cada uno de los argumentos virtuales. Y, a partir de esta información, debemos ser capaces de obtener un índice que nos diga qué función de nuestra tabla debemos llamar.
</p>

<p>
Si tienes curiosidad sobre los detalles de la implementación de los open multi-methods, te dejo el blog de Jean Louis Leroy: <a href="https://www.codeproject.com/Articles/635264/Open-Multi-Methods-for-Cplusplus11-Part-1-The-Case">Open Multi-Methods for C++11</a>.
</p>

<p>
A día de hoy, sólo conozco una librería que podría usarse en un proyecto serio: <a href="https://github.com/jll63/yomm2">Yomm2</a>, de Jean Louis Leroy (el autor del blog anterior).
</p>

<p>
Yo, por otro lado, intenté en su día crear también una implementación de los open multi-methods, y la verdad es que estoy bastante orgulloso de ello. Se llama <a href="https://github.com/Hectarea1996/omm">omm</a> y es un simple fichero <code>omm.h</code> de 1000 líneas de código.
</p>
</div>
</div>

<div id="outline-container-org7af106c" class="outline-2">
<h2 id="org7af106c">Conclusión</h2>
<div class="outline-text-2" id="text-org7af106c">
<p>
Creo que es claro que la mejor solución para resolver el problema del <b>double</b> o <b>multiple dispatch</b> es el uso de <b>open multi-methods</b>. Son limpios, claros, fáciles de usar, etc. Es por ello que me extraña que un lenguaje como C++ no los tenga aún implementados. Y no es que este tipo de métodos sean nuevos, existen desde hace ya años. Por ejemplo, Common Lisp los tiene y es un lenguaje que no se actualiza desde el año 1999. Ains, cómo te echo de menos Common Lisp&#x2026;
</p>

<p>
:D
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="https://hectarea1996.github.io/lispylambda/">UP</a> | <a href="https://hectarea1996.github.io/lispylambda/">HOME</a></p><p></p><p>Autor: Héctor Galbis Sanchis <<a href="mailto:hectometrocuadrado@gmail.com">hectometrocuadrado@gmail.com</a>></p><p>Última edición: 29-07-2023</p>
</div>
</body>
</html>
